#+TITLE: Formalizing graph theory in type theory
#+AUTHOR: Siraphob (Ben) Phipathananunth
#+OPTIONS: toc:nil
#+LATEX_CLASS: scrartcl
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{bussproofs}
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{coqdoc}
#+LATEX_HEADER: \usepackage{algpseudocode,algorithm,algorithmicx}
#+LATEX_HEADER: \newtheorem*{thm*}{Theorem}
#+LATEX_HEADER: \newtheorem{thm}{Theorem}
#+LATEX_HEADER: \newtheorem*{lem}{Lemma}
#+LATEX_HEADER: \usepackage[backend=biber]{biblatex}
#+LATEX_HEADER: \addbibresource{citations.bib}

\newcommand{\typ}{\,:\,}
\newcommand{\lam}[2]{\lambda #1.\,#2}
\newcommand{\app}[2]{#1\,#2}
\newcommand{\red}{\to_\beta}
\newcommand{\tred}{\twoheadrightarrow_\beta}

#+BEGIN_abstract
Despite the rich theory and extensive applications of graph theory in
computer science and mathematics, formal developments of graph theory
have mostly been restricted to specific applications or definitions of
graphs. In this work we seek to catalog various approaches to
formalization of graph theory that have been taken in the literature,
in particular, the motivations underlying the formalization, the
theoretical design choices taken and the strength of the
conclusions. We also present a our own novel formal theory of graphs
to prove correctness of Wigderson's graph coloring algorithm.
#+END_abstract

#+BEGIN_comment
Notes for presentation later:
- interesting thing is that this work involves simultaneously ideas
  from logic, type theory, graph theory and computer science
#+END_comment

#+BEGIN_comment
• Introduction
  • Historical context for logics, formalization of mathematics
• Overview of dependent type theory
  • Comparisons with set theory and first-order theories
  • Curry-Howard correspondence
  • Constructivism and axioms
  • Representation of mathematical objects in type theory
• Overview of graph theory formalizations in Coq
  • math-comp (2008), formalization of four-color theorem
** Organization of the theory
The theory is organized into a series of modules, each of which is
defined in a separate file.

#+CAPTION: Statistics of our graph theory development.
| *Filename*    | *Blank lines* | *Comment lines* | *Code lines* |
|-------------+-------------+---------------+------------|
| ~subgraph.v~  |         138 |           131 |       1145 |
| ~coloring.v~  |          80 |           146 |        994 |
| ~graph.v~     |         122 |           173 |        407 |
| ~wigderson.v~ |          47 |           119 |        228 |
| ~restrict.v~  |          14 |             6 |        181 |
| ~munion.v~    |           6 |             6 |         63 |
|-------------+-------------+---------------+------------|
| *Total*       |         407 |           581 |       3018 |
#+TBLFM: @>$2=vsum(@I..@II)::@>$3=vsum(@I..@II)::@>$4=vsum(@I..@II)


